---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BuildingOpeningTimeParam
source: html/b3031eca-57f7-ad2f-d0ff-c97703df4aee.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BuildingOpeningTimeParam Property

"Opening Time"

## Syntax (C#)
```csharp
public static ForgeTypeId BuildingOpeningTimeParam { get; }
```